-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- 생성 시간: 23-08-01 09:39
-- 서버 버전: 10.4.11-MariaDB
-- PHP 버전: 7.4.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `nodeajaxboard`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `post`
--

CREATE TABLE `post` (
  `idx` int(11) NOT NULL,
  `id` varchar(20) NOT NULL,
  `datetime` datetime NOT NULL,
  `detail` varchar(500) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `post`
--

INSERT INTO `post` (`idx`, `id`, `datetime`, `detail`) VALUES
(1, 'admin', '2023-08-01 12:43:53', '이 글은 테스트 용 글입니다'),
(2, 'admin', '2023-08-01 12:44:14', '이 글은 테스트 용 글입니다'),
(3, 'admin', '2023-08-01 14:17:39', '이 글은 테스트 용 글입니다'),
(4, '안녕하세요. 박재형입니다.', '2023-08-01 14:19:28', '박재형입니다. 잘부탁드립니다.'),
(5, '안녕하세요. 박재형입니다.', '2023-08-01 14:23:07', '박재형입니다. 잘부탁드립니다.'),
(6, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:38', '박재형입니다. 잘부탁드립니다.'),
(7, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:39', '박재형입니다. 잘부탁드립니다.'),
(8, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:39', '박재형입니다. 잘부탁드립니다.'),
(9, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:39', '박재형입니다. 잘부탁드립니다.'),
(10, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:40', '박재형입니다. 잘부탁드립니다.'),
(11, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:40', '박재형입니다. 잘부탁드립니다.'),
(12, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:40', '박재형입니다. 잘부탁드립니다.'),
(13, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:40', '박재형입니다. 잘부탁드립니다.'),
(14, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:40', '박재형입니다. 잘부탁드립니다.'),
(15, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:41', '박재형입니다. 잘부탁드립니다.'),
(16, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:41', '박재형입니다. 잘부탁드립니다.'),
(17, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:41', '박재형입니다. 잘부탁드립니다.'),
(18, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:41', '박재형입니다. 잘부탁드립니다.'),
(19, '안녕하세요. 박재형입니다.', '2023-08-01 14:24:41', '박재형입니다. 잘부탁드립니다.'),
(20, '이게 진짜 처음글', '2023-08-01 14:27:27', '이 글 전으로는 다 까자임'),
(21, '이게 진짜 처음글', '2023-08-01 14:27:46', 'ㅇㅇ'),
(22, 'tour', '2023-08-01 14:28:37', '5'),
(23, 'ㅇㅎ', '2023-08-01 14:30:54', 'ㅇㅎ'),
(24, 'ㅇㅎ', '2023-08-01 14:30:56', 'ㅇㅎ'),
(25, 'ㅇㅎ', '2023-08-01 14:30:56', 'ㅇㅎ'),
(26, 'ㅇㅎ', '2023-08-01 14:30:56', 'ㅇㅎ'),
(27, 'ㅇㅎ', '2023-08-01 14:30:56', 'ㅇㅎ'),
(28, 'ㅇㅎ', '2023-08-01 14:30:57', 'ㅇㅎ'),
(29, 'ㅇㅎ', '2023-08-01 14:30:57', 'ㅇㅎ'),
(30, 'ㅇㅎ', '2023-08-01 14:30:57', 'ㅇㅎ'),
(31, 'ㅇㅎ', '2023-08-01 14:30:57', 'ㅇㅎ'),
(32, 'ㅇㅎ', '2023-08-01 14:30:58', 'ㅇㅎ'),
(33, 'ㅇㅎ', '2023-08-01 14:30:58', 'ㅇㅎ'),
(34, '', '2023-08-01 14:31:30', '');

-- --------------------------------------------------------

--
-- 테이블 구조 `reply`
--

CREATE TABLE `reply` (
  `idx` int(11) NOT NULL,
  `writer_id` varchar(20) NOT NULL,
  `post_idx` int(11) NOT NULL,
  `datetime` datetime NOT NULL,
  `detail` varchar(500) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`idx`);

--
-- 테이블의 인덱스 `reply`
--
ALTER TABLE `reply`
  ADD PRIMARY KEY (`idx`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `post`
--
ALTER TABLE `post`
  MODIFY `idx` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- 테이블의 AUTO_INCREMENT `reply`
--
ALTER TABLE `reply`
  MODIFY `idx` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
